cf_billing/Documents/бестУстановитьТемпературыИсточника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестУстановитьТемпературыИсточника</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестТемператураИсточника</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураПодачиИсточника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемператураХолоднойВодыИсточника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Источники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТемператураПодачиИсточника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТемператураХолоднойВодыИсточника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестТемператураИсточника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестТемператураИсточника</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТемператураПодачиИсточника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТемператураХолоднойВодыИсточника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестУстановитьТемпературыИсточника/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;

	ТекДата	= ТекущаяДата();	
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;	
	
	Ответственный = Пользователи.ТекущийПользователь();
		
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	//ДанныеШапки = ДанныеШапки();
	//
	//Если ЗначениеЗаполнено(Источник) Тогда
	//	бестПроведениеСерверНП.ВыполнитьДвижение(ДанныеШапки, Движения.бестТемператураИсточника);
	//КонецЕсли;
	
	ПроверкаДублированияВТЧ(Отказ);
	ПроверитьНаличиеСуществующихЗаписей(Отказ);
	ТаблицаПроведения = ПолучитьТаблицуПроведения();
	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ТаблицаПроведения, Движения.бестТемператураИсточника, Неопределено);
	
КонецПроцедуры

Функция ПолучитьТаблицуПроведения()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период",				?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата));
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("ПериодРегистрации", 	Дата);
	Запрос.Текст = "ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	&Ссылка КАК Регистратор,
	|	&Район КАК Район,
	|	бестУстановитьТемпературыИсточникаИсточники.Источник КАК Источник,
	|	бестУстановитьТемпературыИсточникаИсточники.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	|	бестУстановитьТемпературыИсточникаИсточники.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника,
	|	&ПериодНачисления КАК ПериодНачисления,
	|	&ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	Документ.бестУстановитьТемпературыИсточника.Источники КАК бестУстановитьТемпературыИсточникаИсточники
	|ГДЕ
	|	бестУстановитьТемпературыИсточникаИсточники.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бестУстановитьТемпературыИсточникаИсточники.Источник,
	|	бестУстановитьТемпературыИсточникаИсточники.ТемператураПодачиИсточника,
	|	бестУстановитьТемпературыИсточникаИсточники.ТемператураХолоднойВодыИсточника";
	Результат = ЗАпрос.Выполнить();
	
	Возврат Результат;
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	энргОрганизацииСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаДублированияВТЧ(Отказ) 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	бестУстановитьТемпературыИсточникаИсточники.Источник КАК Источник,
	|	бестУстановитьТемпературыИсточникаИсточники.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.бестУстановитьТемпературыИсточника.Источники КАК бестУстановитьТемпературыИсточникаИсточники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестУстановитьТемпературыИсточника.Источники КАК бестУстановитьТемпературыИсточникаИсточники1
	|		ПО (бестУстановитьТемпературыИсточникаИсточники.Ссылка = &Ссылка)
	|			И бестУстановитьТемпературыИсточникаИсточники.Источник = бестУстановитьТемпературыИсточникаИсточники1.Источник
	|			И бестУстановитьТемпературыИсточникаИсточники.НомерСтроки <> бестУстановитьТемпературыИсточникаИсточники1.НомерСтроки
	|			И (бестУстановитьТемпературыИсточникаИсточники1.Ссылка = &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	бестУстановитьТемпературыИсточникаИсточники.Источник,
	|	бестУстановитьТемпературыИсточникаИсточники.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Источник
	|ИТОГИ ПО
	|	Источник";
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		ТекстСбщ = "";
		Если ЗначениеЗаполнено(Выборка.Источник) Тогда
			ТекстСбщ	= "По источнику " + Выборка.Источник + " обнаружены дубли в строках: ";
			ВыборкаДетали = Выборка.Выбрать();
			Пока ВыборкаДетали.Следующий() Цикл
				ТекстСбщ	= ТекстСбщ + ВыборкаДетали.НомерСтроки + ";"	
			КонецЦикла;				
		КонецЕсли;
		Если НЕ ТекстСбщ = "" Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСбщ);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

// доработать 
Процедура ПроверитьНаличиеСуществующихЗаписей(Отказ)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", 				?(ЗначениеЗаполнено(Дата), КонецДня(Дата),энргДатаПоследнегоИзменения));
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);

	Запрос.Текст = "ВЫБРАТЬ
	               |	бестУстановитьТемпературыИсточникаИсточники.Источник КАК Источник,
	               |	бестУстановитьТемпературыИсточникаИсточники.ТемператураПодачиИсточника КАК ТемператураПодачиИсточника,
	               |	бестУстановитьТемпературыИсточникаИсточники.ТемператураХолоднойВодыИсточника КАК ТемператураХолоднойВодыИсточника
	               |ПОМЕСТИТЬ ВТ_Услуги
	               |ИЗ
	               |	Документ.бестУстановитьТемпературыИсточника.Источники КАК бестУстановитьТемпературыИсточникаИсточники
	               |ГДЕ
	               |	бестУстановитьТемпературыИсточникаИсточники.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бестТемператураИсточника.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.бестТемператураИсточника КАК бестТемператураИсточника
	               |ГДЕ
	               |	бестТемператураИсточника.Период <= &Дата
	               |	И бестТемператураИсточника.Организация = &Организация
	               |	И бестТемператураИсточника.Район = &Район
	               |	И бестТемператураИсточника.Источник В
	               |			(ВЫБРАТЬ
	               |				ВТ_Услуги.Источник
	               |			ИЗ
	               |				ВТ_Услуги)
	               |	И бестТемператураИсточника.ТемператураПодачиИсточника В
	               |			(ВЫБРАТЬ
	               |				ВТ_Услуги.ТемператураПодачиИсточника
	               |			ИЗ
	               |				ВТ_Услуги)
	               |	И бестТемператураИсточника.ТемператураХолоднойВодыИсточника В
	               |			(ВЫБРАТЬ
	               |				ВТ_Услуги.ТемператураХолоднойВодыИсточника
	               |			ИЗ
	               |				ВТ_Услуги)";
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные по источнику уже введены! Документ " + Выборка.Регистратор);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
